from .base import *
import dj_database_url

DEBUG = False

# ------------------------------------------------------------------------------
# HOSTS
# ------------------------------------------------------------------------------
# EC2 인스턴스의 퍼블릭 IP 주소 또는 연결된 도메인을 입력해주세요.
# 예: ALLOWED_HOSTS = ['13.125.247.205', 'your-domain.com']
ALLOWED_HOSTS = ['YOUR_EC2_IP_OR_DOMAIN']


# ------------------------------------------------------------------------------
# DATABASE
# ------------------------------------------------------------------------------
# EC2 서버의 .env 파일에 DATABASE_URL을 설정하여 사용합니다.
DATABASES = {
    'default': dj_database_url.config(conn_max_age=600)
}
# ------------------------------------------------------------------------------

# Add any other production-specific settings here
